{"class_name": "Model", "keras_version": "1.2.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [2, 320, 320, 3], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block1_conv1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "block1_conv1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block1_conv2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["block1_conv1", 0, 0]]], "name": "block1_conv2"}, {"class_name": "MaxPooling2D", "config": {"name": "block1_pool", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["block1_conv2", 0, 0]]], "name": "block1_pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block2_conv1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["block1_pool", 0, 0]]], "name": "block2_conv1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block2_conv2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["block2_conv1", 0, 0]]], "name": "block2_conv2"}, {"class_name": "MaxPooling2D", "config": {"name": "block2_pool", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["block2_conv2", 0, 0]]], "name": "block2_pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block3_conv1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["block2_pool", 0, 0]]], "name": "block3_conv1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block3_conv2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["block3_conv1", 0, 0]]], "name": "block3_conv2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block3_conv3", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["block3_conv2", 0, 0]]], "name": "block3_conv3"}, {"class_name": "MaxPooling2D", "config": {"name": "block3_pool", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["block3_conv3", 0, 0]]], "name": "block3_pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block4_conv1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["block3_pool", 0, 0]]], "name": "block4_conv1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block4_conv2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["block4_conv1", 0, 0]]], "name": "block4_conv2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block4_conv3", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["block4_conv2", 0, 0]]], "name": "block4_conv3"}, {"class_name": "MaxPooling2D", "config": {"name": "block4_pool", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["block4_conv3", 0, 0]]], "name": "block4_pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block5_conv1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["block4_pool", 0, 0]]], "name": "block5_conv1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block5_conv2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["block5_conv1", 0, 0]]], "name": "block5_conv2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block5_conv3", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["block5_conv2", 0, 0]]], "name": "block5_conv3"}, {"class_name": "MaxPooling2D", "config": {"name": "block5_pool", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["block5_conv3", 0, 0]]], "name": "block5_pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fc1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 7, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 4096, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 7}, "inbound_nodes": [[["block5_pool", 0, 0]]], "name": "fc1"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["fc1", 0, 0]]], "name": "dropout_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fc2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 4096, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "fc2"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["fc2", 0, 0]]], "name": "dropout_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 21, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "convolution2d_1"}, {"class_name": "BilinearUpSampling2D", "config": {"target_size": null, "trainable": true, "name": "bilinearupsampling2d_1", "size": [32, 32]}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "bilinearupsampling2d_1"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["bilinearupsampling2d_1", 0, 0]], "name": "model_1"}}