{"class_name": "Model", "keras_version": "1.2.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [8, 320, 320, 3], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 7, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 7}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "conv1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn_conv1", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["conv1", 0, 0]]], "name": "bn_conv1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["bn_conv1", 0, 0]]], "name": "activation_1"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf", "pool_size": [3, 3], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["activation_1", 0, 0]]], "name": "maxpooling2d_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2a_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "res2a_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2a_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2a_branch2a", 0, 0]]], "name": "bn2a_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["bn2a_branch2a", 0, 0]]], "name": "activation_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2a_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_2", 0, 0]]], "name": "res2a_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2a_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2a_branch2b", 0, 0]]], "name": "bn2a_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["bn2a_branch2b", 0, 0]]], "name": "activation_3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2a_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_3", 0, 0]]], "name": "res2a_branch2c"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2a_branch1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "res2a_branch1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2a_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2a_branch2c", 0, 0]]], "name": "bn2a_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2a_branch1", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2a_branch1", 0, 0]]], "name": "bn2a_branch1"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn2a_branch2c", 0, 0], ["bn2a_branch1", 0, 0]]], "name": "merge_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "activation_4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2b_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_4", 0, 0]]], "name": "res2b_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2b_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2b_branch2a", 0, 0]]], "name": "bn2b_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "inbound_nodes": [[["bn2b_branch2a", 0, 0]]], "name": "activation_5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2b_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_5", 0, 0]]], "name": "res2b_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2b_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2b_branch2b", 0, 0]]], "name": "bn2b_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "inbound_nodes": [[["bn2b_branch2b", 0, 0]]], "name": "activation_6"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2b_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_6", 0, 0]]], "name": "res2b_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2b_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2b_branch2c", 0, 0]]], "name": "bn2b_branch2c"}, {"class_name": "Merge", "config": {"name": "merge_2", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn2b_branch2c", 0, 0], ["activation_4", 0, 0]]], "name": "merge_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "inbound_nodes": [[["merge_2", 0, 0]]], "name": "activation_7"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2c_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_7", 0, 0]]], "name": "res2c_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2c_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2c_branch2a", 0, 0]]], "name": "bn2c_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "inbound_nodes": [[["bn2c_branch2a", 0, 0]]], "name": "activation_8"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2c_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_8", 0, 0]]], "name": "res2c_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2c_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2c_branch2b", 0, 0]]], "name": "bn2c_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "inbound_nodes": [[["bn2c_branch2b", 0, 0]]], "name": "activation_9"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2c_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_9", 0, 0]]], "name": "res2c_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2c_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2c_branch2c", 0, 0]]], "name": "bn2c_branch2c"}, {"class_name": "Merge", "config": {"name": "merge_3", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn2c_branch2c", 0, 0], ["activation_7", 0, 0]]], "name": "merge_3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}, "inbound_nodes": [[["merge_3", 0, 0]]], "name": "activation_10"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3a_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_10", 0, 0]]], "name": "res3a_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3a_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3a_branch2a", 0, 0]]], "name": "bn3a_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}, "inbound_nodes": [[["bn3a_branch2a", 0, 0]]], "name": "activation_11"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3a_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_11", 0, 0]]], "name": "res3a_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3a_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3a_branch2b", 0, 0]]], "name": "bn3a_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}, "inbound_nodes": [[["bn3a_branch2b", 0, 0]]], "name": "activation_12"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3a_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_12", 0, 0]]], "name": "res3a_branch2c"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3a_branch1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_10", 0, 0]]], "name": "res3a_branch1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3a_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3a_branch2c", 0, 0]]], "name": "bn3a_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3a_branch1", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3a_branch1", 0, 0]]], "name": "bn3a_branch1"}, {"class_name": "Merge", "config": {"name": "merge_4", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn3a_branch2c", 0, 0], ["bn3a_branch1", 0, 0]]], "name": "merge_4"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_13"}, "inbound_nodes": [[["merge_4", 0, 0]]], "name": "activation_13"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3b_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_13", 0, 0]]], "name": "res3b_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3b_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3b_branch2a", 0, 0]]], "name": "bn3b_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_14"}, "inbound_nodes": [[["bn3b_branch2a", 0, 0]]], "name": "activation_14"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3b_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_14", 0, 0]]], "name": "res3b_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3b_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3b_branch2b", 0, 0]]], "name": "bn3b_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_15"}, "inbound_nodes": [[["bn3b_branch2b", 0, 0]]], "name": "activation_15"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3b_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_15", 0, 0]]], "name": "res3b_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3b_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3b_branch2c", 0, 0]]], "name": "bn3b_branch2c"}, {"class_name": "Merge", "config": {"name": "merge_5", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn3b_branch2c", 0, 0], ["activation_13", 0, 0]]], "name": "merge_5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_16"}, "inbound_nodes": [[["merge_5", 0, 0]]], "name": "activation_16"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3c_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_16", 0, 0]]], "name": "res3c_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3c_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3c_branch2a", 0, 0]]], "name": "bn3c_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_17"}, "inbound_nodes": [[["bn3c_branch2a", 0, 0]]], "name": "activation_17"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3c_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_17", 0, 0]]], "name": "res3c_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3c_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3c_branch2b", 0, 0]]], "name": "bn3c_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_18"}, "inbound_nodes": [[["bn3c_branch2b", 0, 0]]], "name": "activation_18"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3c_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_18", 0, 0]]], "name": "res3c_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3c_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3c_branch2c", 0, 0]]], "name": "bn3c_branch2c"}, {"class_name": "Merge", "config": {"name": "merge_6", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn3c_branch2c", 0, 0], ["activation_16", 0, 0]]], "name": "merge_6"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_19"}, "inbound_nodes": [[["merge_6", 0, 0]]], "name": "activation_19"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3d_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_19", 0, 0]]], "name": "res3d_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3d_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3d_branch2a", 0, 0]]], "name": "bn3d_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_20"}, "inbound_nodes": [[["bn3d_branch2a", 0, 0]]], "name": "activation_20"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3d_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_20", 0, 0]]], "name": "res3d_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3d_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3d_branch2b", 0, 0]]], "name": "bn3d_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_21"}, "inbound_nodes": [[["bn3d_branch2b", 0, 0]]], "name": "activation_21"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3d_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_21", 0, 0]]], "name": "res3d_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3d_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3d_branch2c", 0, 0]]], "name": "bn3d_branch2c"}, {"class_name": "Merge", "config": {"name": "merge_7", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn3d_branch2c", 0, 0], ["activation_19", 0, 0]]], "name": "merge_7"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_22"}, "inbound_nodes": [[["merge_7", 0, 0]]], "name": "activation_22"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4a_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_22", 0, 0]]], "name": "res4a_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4a_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4a_branch2a", 0, 0]]], "name": "bn4a_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_23"}, "inbound_nodes": [[["bn4a_branch2a", 0, 0]]], "name": "activation_23"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4a_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_23", 0, 0]]], "name": "res4a_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4a_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4a_branch2b", 0, 0]]], "name": "bn4a_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_24"}, "inbound_nodes": [[["bn4a_branch2b", 0, 0]]], "name": "activation_24"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4a_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1024, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_24", 0, 0]]], "name": "res4a_branch2c"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4a_branch1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 1024, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_22", 0, 0]]], "name": "res4a_branch1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4a_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4a_branch2c", 0, 0]]], "name": "bn4a_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4a_branch1", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4a_branch1", 0, 0]]], "name": "bn4a_branch1"}, {"class_name": "Merge", "config": {"name": "merge_8", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn4a_branch2c", 0, 0], ["bn4a_branch1", 0, 0]]], "name": "merge_8"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_25"}, "inbound_nodes": [[["merge_8", 0, 0]]], "name": "activation_25"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4b_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_25", 0, 0]]], "name": "res4b_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4b_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4b_branch2a", 0, 0]]], "name": "bn4b_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_26"}, "inbound_nodes": [[["bn4b_branch2a", 0, 0]]], "name": "activation_26"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4b_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_26", 0, 0]]], "name": "res4b_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4b_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4b_branch2b", 0, 0]]], "name": "bn4b_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_27"}, "inbound_nodes": [[["bn4b_branch2b", 0, 0]]], "name": "activation_27"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4b_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1024, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_27", 0, 0]]], "name": "res4b_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4b_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4b_branch2c", 0, 0]]], "name": "bn4b_branch2c"}, {"class_name": "Merge", "config": {"name": "merge_9", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn4b_branch2c", 0, 0], ["activation_25", 0, 0]]], "name": "merge_9"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_28"}, "inbound_nodes": [[["merge_9", 0, 0]]], "name": "activation_28"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4c_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_28", 0, 0]]], "name": "res4c_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4c_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4c_branch2a", 0, 0]]], "name": "bn4c_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_29"}, "inbound_nodes": [[["bn4c_branch2a", 0, 0]]], "name": "activation_29"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4c_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_29", 0, 0]]], "name": "res4c_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4c_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4c_branch2b", 0, 0]]], "name": "bn4c_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_30"}, "inbound_nodes": [[["bn4c_branch2b", 0, 0]]], "name": "activation_30"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4c_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1024, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_30", 0, 0]]], "name": "res4c_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4c_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4c_branch2c", 0, 0]]], "name": "bn4c_branch2c"}, {"class_name": "Merge", "config": {"name": "merge_10", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn4c_branch2c", 0, 0], ["activation_28", 0, 0]]], "name": "merge_10"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_31"}, "inbound_nodes": [[["merge_10", 0, 0]]], "name": "activation_31"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4d_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_31", 0, 0]]], "name": "res4d_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4d_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4d_branch2a", 0, 0]]], "name": "bn4d_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_32"}, "inbound_nodes": [[["bn4d_branch2a", 0, 0]]], "name": "activation_32"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4d_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_32", 0, 0]]], "name": "res4d_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4d_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4d_branch2b", 0, 0]]], "name": "bn4d_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_33"}, "inbound_nodes": [[["bn4d_branch2b", 0, 0]]], "name": "activation_33"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4d_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1024, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_33", 0, 0]]], "name": "res4d_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4d_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4d_branch2c", 0, 0]]], "name": "bn4d_branch2c"}, {"class_name": "Merge", "config": {"name": "merge_11", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn4d_branch2c", 0, 0], ["activation_31", 0, 0]]], "name": "merge_11"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_34"}, "inbound_nodes": [[["merge_11", 0, 0]]], "name": "activation_34"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4e_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_34", 0, 0]]], "name": "res4e_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4e_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4e_branch2a", 0, 0]]], "name": "bn4e_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_35"}, "inbound_nodes": [[["bn4e_branch2a", 0, 0]]], "name": "activation_35"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4e_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_35", 0, 0]]], "name": "res4e_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4e_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4e_branch2b", 0, 0]]], "name": "bn4e_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_36"}, "inbound_nodes": [[["bn4e_branch2b", 0, 0]]], "name": "activation_36"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4e_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1024, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_36", 0, 0]]], "name": "res4e_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4e_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4e_branch2c", 0, 0]]], "name": "bn4e_branch2c"}, {"class_name": "Merge", "config": {"name": "merge_12", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn4e_branch2c", 0, 0], ["activation_34", 0, 0]]], "name": "merge_12"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_37"}, "inbound_nodes": [[["merge_12", 0, 0]]], "name": "activation_37"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4f_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_37", 0, 0]]], "name": "res4f_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4f_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4f_branch2a", 0, 0]]], "name": "bn4f_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_38"}, "inbound_nodes": [[["bn4f_branch2a", 0, 0]]], "name": "activation_38"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4f_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_38", 0, 0]]], "name": "res4f_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4f_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4f_branch2b", 0, 0]]], "name": "bn4f_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_39"}, "inbound_nodes": [[["bn4f_branch2b", 0, 0]]], "name": "activation_39"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4f_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1024, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_39", 0, 0]]], "name": "res4f_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4f_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4f_branch2c", 0, 0]]], "name": "bn4f_branch2c"}, {"class_name": "Merge", "config": {"name": "merge_13", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn4f_branch2c", 0, 0], ["activation_37", 0, 0]]], "name": "merge_13"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_40"}, "inbound_nodes": [[["merge_13", 0, 0]]], "name": "activation_40"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res5a_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_40", 0, 0]]], "name": "res5a_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn5a_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res5a_branch2a", 0, 0]]], "name": "bn5a_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_41"}, "inbound_nodes": [[["bn5a_branch2a", 0, 0]]], "name": "activation_41"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res5a_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_41", 0, 0]]], "name": "res5a_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn5a_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res5a_branch2b", 0, 0]]], "name": "bn5a_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_42"}, "inbound_nodes": [[["bn5a_branch2b", 0, 0]]], "name": "activation_42"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res5a_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 2048, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_42", 0, 0]]], "name": "res5a_branch2c"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res5a_branch1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 2048, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_40", 0, 0]]], "name": "res5a_branch1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn5a_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res5a_branch2c", 0, 0]]], "name": "bn5a_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn5a_branch1", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res5a_branch1", 0, 0]]], "name": "bn5a_branch1"}, {"class_name": "Merge", "config": {"name": "merge_14", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn5a_branch2c", 0, 0], ["bn5a_branch1", 0, 0]]], "name": "merge_14"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_43"}, "inbound_nodes": [[["merge_14", 0, 0]]], "name": "activation_43"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res5b_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_43", 0, 0]]], "name": "res5b_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn5b_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": 